Revit 2027 API
ExternalResourceSubFolder(String, String) Constructor
 Constructs a new ExternalResourceSubFolder with custom values for folder name and icon path.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public ExternalResourceSubFolder(
	string folderName,
	string iconPath
)
Public Sub New (
	folderName As String,
	iconPath As String
)
public:
ExternalResourceSubFolder(
	String^ folderName,
	String^ iconPath
)
new :
        folderName : string *
        iconPath : string -> ExternalResourceSubFolder
Parameters
folderName String
 Folder displayed name.
iconPath String
 The path of the resource icon.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
See Also
Reference
ExternalResourceSubFolder Class
ExternalResourceSubFolder Overload
Autodesk.Revit.DB Namespace